"""
python内置函数
    len() 统计数量
    del() 删除变量
    max() 最大值 (比较字典的key)
    min() 最小值 (比较字典的key)
    cmp(item1, item2)  3.x已删除

切片
    切片方法适用 字符串，列表，元祖
    data[开始索引:结束索引:步长]
    包前不包后
    开始浊音不给数值，表示从头开始，结束索引不给数值，表示截取到最末尾
    步长为负数  逆序切片


|----------------------------------------------------------------------------------|
|operator   | Python expression |  result     | desc      |     suit               |
|----------------------------------------------------------------------------------|
| +         | [1,2] + [3,4]     | [1,2,3,4]   | merge     | string list tuple      |
|----------------------------------------------------------------------------------|
| *         | ["ab"] * 2        | ["ab","ab"] | repeat    | string list tuple      |
|----------------------------------------------------------------------------------|
| in        | 2 in (1,2,3)      |  True       | exist     | string list tuple dict |
|----------------------------------------------------------------------------------|
| not in    | 3 not in (1,2,3)  |  False      | not exist | string list tuple dict |
|----------------------------------------------------------------------------------|
| >  >=     | (1,2,3) < (2,2,3  |  True       | compare   | string list tuple      |
| ==  <  <= |                   |             |           |                        |
|----------------------------------------------------------------------------------|

字典里的操作都是针对key值


for - else
"""

str = "0123456789"

print(str[::-1])

finish = True
for char in str:
    print(char)
    if (char == "6"):
        if (finish):
            pass
        else:
            break #循环被中间打断  else就不执行
else:
    print("正常循环完成才会执行")
